---
kind: other
id: Methods.T:Autodesk.Revit.DB.DocumentPreviewSettings
source: html/c08268b7-8d3a-4528-a1d5-7e05c4647c62.htm
---
# DocumentPreviewSettings Methods

Sets Revit to update the preview view if necessary.